package com.shikidroid.domain.models.common

/**
 * Статус выхода произведения
 */
enum class AiredStatus {

    /**
     * Анонсировано
     */
    ANONS,

    /**
     * Выходит
     */
    ONGOING,

    /**
     * Вышло
     */
    RELEASED,

    /**
     * Недавно вышедшее
     */
    LATEST,

    ///////////////////////////////////////////////////////////////////////////
    // Дополнительные статусы для манги
    ///////////////////////////////////////////////////////////////////////////

    /**
     * Паузы в выпуске манги
     */
    PAUSED,

    /**
     * Манга перестала выпускаться
     */
    DISCONTINUED,

    ///////////////////////////////////////////////////////////////////////////
    // Статусы, если пришла любая другая строка
    ///////////////////////////////////////////////////////////////////////////

    /**
     * Пока неизвестно
     */
    NONE,

    /**
     * Неизвестный статус (если придёт что-то не из списка)
     */
    UNKNOWN
}