package com.shikidroid.domain.models.common

/**
 * Подтип контента в сообщении
 */
enum class LinkedContentProductType {

    ///////////////////////////////////////////////////////////////////////////
    // ANIME TYPE
    ///////////////////////////////////////////////////////////////////////////

    /**
     * ТВ-сериал
     */
    TV,

    /**
     * Полнометражный фильм
     */
    MOVIE,

    /**
     * Специальная серия (спэшл)
     */
    SPECIAL,

    /**
     * Музыкальное видео
     */
    MUSIC,

    /**
     * Original Video Animation
     */
    OVA,

    /**
     * Original Net Animation
     */
    ONA,

    /**
     * 13-серийное аниме
     */
    TV_13,

    /**
     * 24-серийное аниме
     */
    TV_24,

    /**
     * 48-серийное аниме
     */
    TV_48,

    ///////////////////////////////////////////////////////////////////////////
    // MANGA TYPE
    ///////////////////////////////////////////////////////////////////////////

    /**
     * Японская манга
     */
    MANGA,

    /**
     * Корейская манхва
     */
    MANHWA,

    /**
     * Китайская маньхуа
     */
    MANHUA,

    /**
     * Новелла
     */
    NOVEL,

    /**
     * Ваншот
     */
    ONE_SHOT,

    /**
     * Додзинси
     */
    DOUJIN,

    ///////////////////////////////////////////////////////////////////////////
    // RANOBE TYPE
    ///////////////////////////////////////////////////////////////////////////

    /**
     * Пока нет типа
     */
    NONE,

    /**
     * Неизвестный тип (если придёт что-то не из списка)
     */
    UNKNOWN
}